  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/add-firewall` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/dc5906cb-03c4-4cc1-be97-08110940f4b3/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.eastus2-vms[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus2"
    + max_bid_price                   = -1
    + name                            = "eastus2-vm-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDXfeNESzeBpNFl0W8801NXA+539N6Q06VPKFV63alXC77aoNgNBNU16jDajStBz7zA6brxhwhwTR9V4zQwLJxLkmq2oO8mm1zqy1AgeWC2/zwvp7PJ1Md7vNbmERInJ6FN8C6Xa7jf3NbFQfnaodnb9j+zuFKN4HGi0+Su/EUzvMAqeMS1RjFTxQGhpG0zRdHL9sqnKKR2c9S3/XSWNFej3XFueuMhUnGqyv84vVZYx6SpH383wFIa7Y1p+Skkf3o9WQsQ6pdGvcTIDx6V4+vo5lKUmMOHLiJNx3fGjoDHIDbnhT1GH2Hb8IjFkUKfRqCLr1zKxiWoMxmb/Ipx0FnF jcetina@Jasons-MBP
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# module.eastus2-vms[0].azurerm_network_interface.nic will be created
+ resource "azurerm_network_interface" "nic" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "eastus2"
    + mac_address                   = (known after apply)
    + name                          = "eastus2-vm-0-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + public_ip_address_id                               = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/eastus2-vm-0-public-ip"
        + subnet_id                                          = (known after apply)
      }
  }

# module.eastus2-vms[0].azurerm_network_interface_security_group_association.nsg_association will be created
+ resource "azurerm_network_interface_security_group_association" "nsg_association" {
    + id                        = (known after apply)
    + network_interface_id      = (known after apply)
    + network_security_group_id = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/eastus2-vm-0-nsg"
  }

# module.sites["eastus2"].azurerm_subnet.vm will be created
+ resource "azurerm_subnet" "vm" {
    + address_prefixes                               = [
        + "10.0.1.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "VmSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-eastus2"
  }

# module.westus2-vms[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "westus2"
    + max_bid_price                   = -1
    + name                            = "westus2-vm-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDXfeNESzeBpNFl0W8801NXA+539N6Q06VPKFV63alXC77aoNgNBNU16jDajStBz7zA6brxhwhwTR9V4zQwLJxLkmq2oO8mm1zqy1AgeWC2/zwvp7PJ1Md7vNbmERInJ6FN8C6Xa7jf3NbFQfnaodnb9j+zuFKN4HGi0+Su/EUzvMAqeMS1RjFTxQGhpG0zRdHL9sqnKKR2c9S3/XSWNFej3XFueuMhUnGqyv84vVZYx6SpH383wFIa7Y1p+Skkf3o9WQsQ6pdGvcTIDx6V4+vo5lKUmMOHLiJNx3fGjoDHIDbnhT1GH2Hb8IjFkUKfRqCLr1zKxiWoMxmb/Ipx0FnF jcetina@Jasons-MBP
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# module.westus2-vms[0].azurerm_network_interface.nic will be created
+ resource "azurerm_network_interface" "nic" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "westus2"
    + mac_address                   = (known after apply)
    + name                          = "westus2-vm-0-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + public_ip_address_id                               = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/westus2-vm-0-public-ip"
        + subnet_id                                          = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2/subnets/VmSubnet"
      }
  }

# module.westus2-vms[0].azurerm_network_interface_security_group_association.nsg_association will be created
+ resource "azurerm_network_interface_security_group_association" "nsg_association" {
    + id                        = (known after apply)
    + network_interface_id      = (known after apply)
    + network_security_group_id = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/westus2-vm-0-nsg"
  }

Plan: 7 to add, 0 to change, 0 to destroy.
module.sites["eastus2"].azurerm_subnet.vm: Creating...
module.sites["eastus2"].azurerm_subnet.vm: Creation complete after 4s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/VmSubnet]
module.eastus2-vms[0].azurerm_network_interface.nic: Creating...
module.westus2-vms[0].azurerm_network_interface.nic: Creating...
module.westus2-vms[0].azurerm_network_interface.nic: Creation complete after 2s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/westus2-vm-0-nic]
module.westus2-vms[0].azurerm_network_interface_security_group_association.nsg_association: Creating...
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Creating...
module.eastus2-vms[0].azurerm_network_interface.nic: Creation complete after 3s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/eastus2-vm-0-nic]
module.eastus2-vms[0].azurerm_network_interface_security_group_association.nsg_association: Creating...
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Creating...
module.westus2-vms[0].azurerm_network_interface_security_group_association.nsg_association: Creation complete after 1s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/westus2-vm-0-nic|/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/westus2-vm-0-nsg]
module.eastus2-vms[0].azurerm_network_interface_security_group_association.nsg_association: Creation complete after 1s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/eastus2-vm-0-nic|/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/eastus2-vm-0-nsg]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [50s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [50s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Creation complete after 53s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/westus2-vm-0]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Creation complete after 53s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/eastus2-vm-0]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.
```

  </details>